app/controllers/klasses_controller.rb

SELECT "klasses".* FROM "klasses"
---
  def index
    if params[:search]
      @search = Klass.search do