app/controllers/schedules_controller.rb

SELECT  "schedules".* FROM "schedules"  WHERE "schedules"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @schedules = Schedule.find(1)