app/controllers/sections_controller.rb

  def index
    @sections = Section.find(1)
---
SELECT  "sections".* FROM "sections"  WHERE "sections"."id" = $1 LIMIT 1  [["id", "all"]]